cf_billing/Documents/бестПерерасчетЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестПерерасчетЭЭ</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бестНачисленныйСреднийОбъемЭЭ</xr:Item>
				<xr:Item>AccumulationRegister.бестОбъемНачисленийЭлектроэнергии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПерерасчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПочасоваяВедомость</v8:Type>
						<v8:Type>cfg:DocumentRef.бестИзменитьПараметрыТочкиУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.бестОперацияСПриборомУчетаНП</v8:Type>
						<v8:Type>cfg:DocumentRef.бестОперацияСУслугамиНП</v8:Type>
						<v8:Type>cfg:DocumentRef.бестЗаключениеДоговоровСЮридическимиЛицами</v8:Type>
						<v8:Type>cfg:DocumentRef.бестРегистрацияПоказанийНП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируемыеПоказания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестРегистрацияПоказанийНП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестЦеновыеКатегорииТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестЦеновыеКатегорииТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестВидыДифференцированностиПриборовУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестВидыДифференцированностиПриборовУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДифференцированности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестТочкиПоставкиТочекУчетаЮЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТочкиПоставкиТочекУчетаЮЛ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПараметрыТочекПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПараметрыТочекПоставки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МаксимальнаяМощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрисоединеннаяМощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СетеваяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктураСети</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньНапряжения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргУровниНапряжения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньНапряженияРасчетный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргУровниНапряжения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорТП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыТехнологическогоПрисоединения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктТП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАктыТехнологическогоПрисоединения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочкаПрисоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГТП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыТочекПоставки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРынка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыРынка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмежныйСубъектОРЭМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитыПСИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорПередачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорПокупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтделениеЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктРазграниченияБалансовойПринадлежности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАктыРазграниченияБалансовойПринадлежности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НапряжениеГБП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестЗначенияСбытовойНадбавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестЗначенияСбытовойНадбавки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонМощности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестДиапазоныМощности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестТарифыНаПередачуЭлектроэнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТарифыНаПередачуЭлектроэнергии</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияНапряжения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргУровниНапряжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестПерерасчетЭЭ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.свойство("Основание") Тогда
		СтандартнаяОбработка 	= Ложь;
		ВыбраннаяФорма = "ФормаДокументаСвязанныйПерерасчет";
		Возврат;
	КонецЕсли;
	
	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗаполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;	
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		Если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестПерерасчетЭЭ",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестПерерасчетЭЭ",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестПерерасчетЭЭ",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		Иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.бестФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","бестПерерасчетЭЭ");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Получить отборы начисления
//
// Параметры:
//  ОснованиеПерерасчета - ДокументСсылка.бестПочасоваяВедомость, ДокументСсылка.бестИзменитьПараметрыТочкиУчета, ДокументСсылка.бестОперацияСПриборомУчетаНП, 
//							ДокументСсылка.бестОперацияСУслугамиНП, ДокументСсылка.бестЗаключениеДоговоровСЮридическимиЛицами, ДокументСсылка.бестРегистрацияПоказанийНП 
//  ПериодНачисления	 - Дата 
//	МВТ  				 - МенеджерВременныхТаблиц
//
// Возвращаемое значение:
//	СоответствиеОтборов - Соответствие 
//
Функция ПолучитьОтборыНачисления(ОснованиеПерерасчета, ПериодНачисления, МВТ = Неопределено) Экспорт
	СоответствиеОтборов = Новый Соответствие;
	Запрос = Новый Запрос;
	Если МВТ <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МВТ;
	КонецЕсли;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка КАК ДокРегистратор,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицами.Организация КАК Организация,
		|	бестЗаключениеДоговоровСЮридическимиЛицами.Район КАК Район,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.МКД КАК МКД,
		|	бестЗаключениеДоговоровСЮридическимиЛицами.ДатаФактическогоСобытия КАК ПериодРегистрации,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ ДанныеПерерасчетаТУ
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами КАК бестЗаключениеДоговоровСЮридическимиЛицами
		|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицами.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета
		|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Ссылка
		|			И бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.IDСтрокиВладельца
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестПочасоваяВедомость.Ссылка,
		|	бестПочасоваяВедомость.ОбъектРасчета,
		|	бестПочасоваяВедомость.Организация,
		|	бестПочасоваяВедомость.Район,
		|	&ПериодНачисления,
		|	бестОбъектыРасчета.МКД,
		|	бестПочасоваяВедомость.ДатаФактическогоСобытия,
		|	бестПочасоваяВедомость.ТочкаУчета
		|ИЗ
		|	Документ.бестПочасоваяВедомость КАК бестПочасоваяВедомость
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
		|		ПО бестПочасоваяВедомость.ОбъектРасчета = бестОбъектыРасчета.Ссылка
		|ГДЕ
		|	бестПочасоваяВедомость.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестИзменитьПараметрыТочкиУчета.Ссылка,
		|	бестИзменитьПараметрыТочкиУчета.ОбъектРасчета,
		|	бестИзменитьПараметрыТочкиУчета.Организация,
		|	бестИзменитьПараметрыТочкиУчета.Район,
		|	&ПериодНачисления,
		|	бестОбъектыРасчета.МКД,
		|	бестИзменитьПараметрыТочкиУчета.ДатаФактическогоСобытия,
		|	бестИзменитьПараметрыТочкиУчета.ТочкаУчета
		|ИЗ
		|	Документ.бестИзменитьПараметрыТочкиУчета КАК бестИзменитьПараметрыТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
		|		ПО бестИзменитьПараметрыТочкиУчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
		|ГДЕ
		|	бестИзменитьПараметрыТочкиУчета.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестОперацияСУслугамиНП.Ссылка,
		|	бестОперацияСУслугамиНП.ОбъектРасчета,
		|	бестОперацияСУслугамиНП.Организация,
		|	бестОперацияСУслугамиНП.Район,
		|	&ПериодНачисления,
		|	бестОбъектыРасчета.МКД,
		|	бестОперацияСУслугамиНП.ДатаФактическогоСобытия,
		|	бестОперацияСУслугамиНПТочкиУчета.ТочкаУчета
		|ИЗ
		|	Документ.бестОперацияСУслугамиНП.ТочкиУчета КАК бестОперацияСУслугамиНПТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП КАК бестОперацияСУслугамиНП
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
		|			ПО бестОперацияСУслугамиНП.ОбъектРасчета = бестОбъектыРасчета.Ссылка
		|		ПО бестОперацияСУслугамиНПТочкиУчета.Ссылка = бестОперацияСУслугамиНП.Ссылка
		|ГДЕ
		|	бестОперацияСУслугамиНП.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестОперацияСПриборомУчетаНП.Ссылка,
		|	бестОперацияСПриборомУчетаНП.ОбъектРасчета,
		|	бестОперацияСПриборомУчетаНП.Организация,
		|	бестОперацияСПриборомУчетаНП.Район,
		|	&ПериодНачисления,
		|	бестОбъектыРасчета.МКД,
		|	бестОперацияСПриборомУчетаНП.ДатаФактическогоСобытия,
		|	бестОперацияСПриборомУчетаНПТочкиУчета.ТочкаУчета
		|ИЗ
		|	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК бестОперацияСПриборомУчетаНПТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП КАК бестОперацияСПриборомУчетаНП
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
		|			ПО бестОперацияСПриборомУчетаНП.ОбъектРасчета = бестОбъектыРасчета.Ссылка
		|		ПО бестОперацияСПриборомУчетаНПТочкиУчета.Ссылка = бестОперацияСПриборомУчетаНП.Ссылка
		|ГДЕ
		|	бестОперацияСПриборомУчетаНП.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестРегистрацияПоказанийНП.Ссылка,
		|	бестРегистрацияПоказанийНП.ОбъектРасчета,
		|	бестРегистрацияПоказанийНП.Организация,
		|	бестРегистрацияПоказанийНП.Район,
		|	&ПериодНачисления,
		|	бестОбъектыРасчета.МКД,
		|	бестРегистрацияПоказанийНП.ДатаФактическогоСобытия,
		|	бестРегистрацияПоказанийНПТочкиУчета.ТочкаУчета
		|ИЗ
		|	Документ.бестРегистрацияПоказанийНП.ТочкиУчета КАК бестРегистрацияПоказанийНПТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРегистрацияПоказанийНП КАК бестРегистрацияПоказанийНП
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
		|			ПО бестРегистрацияПоказанийНП.ОбъектРасчета = бестОбъектыРасчета.Ссылка
		|		ПО бестРегистрацияПоказанийНПТочкиУчета.Ссылка = бестРегистрацияПоказанийНП.Ссылка
		|ГДЕ
		|	бестРегистрацияПоказанийНП.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеПерерасчетаТУ.ДокРегистратор КАК ДокРегистратор,
		|	ДанныеПерерасчетаТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ДанныеПерерасчетаТУ.Организация КАК Организация,
		|	ДанныеПерерасчетаТУ.Район КАК Район,
		|	ДанныеПерерасчетаТУ.ПериодНачисления КАК ПериодНачисления,
		|	ДанныеПерерасчетаТУ.МКД КАК МКД,
		|	ДанныеПерерасчетаТУ.ПериодРегистрации КАК ПериодРегистрации
		|ПОМЕСТИТЬ ДанныеПерерасчета
		|ИЗ
		|	ДанныеПерерасчетаТУ КАК ДанныеПерерасчетаТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПерерасчетаТУ.МКД КАК МКД,
		|	ДанныеПерерасчетаТУ.ТочкаУчета КАК ТочкаУчета,
		|	ДанныеПерерасчетаТУ.ОбъектРасчета КАК ОбъектРасчета
		|ИЗ
		|	ДанныеПерерасчетаТУ КАК ДанныеПерерасчетаТУ
		|ИТОГИ ПО
		|	МКД,
		|	ОбъектРасчета";
	
	Запрос.УстановитьПараметр("Ссылка", 			ОснованиеПерерасчета);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМКД = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаМКД.Следующий() Цикл
		СтруктураОтборов = Новый Структура("ОбъектыРасчета, ТУ");
		
		ВыборкаОбъектРасчета = ВыборкаМКД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаОбъектРасчета.Следующий() Цикл
			МассивОбъектов = Новый Массив;
			МассивТУ = Новый Массив;
	        МассивОбъектов.Добавить(ВыборкаОбъектРасчета.ОбъектРасчета);
			ВыборкаДетальныеЗаписи = ВыборкаОбъектРасчета.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
	        	МассивТУ.Добавить(ВыборкаДетальныеЗаписи.ТочкаУчета);

			КонецЦикла;
		КонецЦикла;
		СтруктураОтборов.ОбъектыРасчета = МассивОбъектов;
		СтруктураОтборов.ТУ 			= МассивТУ;
		СоответствиеОтборов.Вставить(ВыборкаМКД.МКД, СтруктураОтборов);

	КонецЦикла;

	Возврат СоответствиеОтборов;
	
КонецФункции

// Процедура - Заполнить данные корректировки
//
// Параметры:
//	Договор 	- РегистрыНакопления.бестОбъемНачисленийЭлектроэнергии.Договор
//	Регистратор - РегистрыНакопления.бестОбъемНачисленийЭлектроэнергии.Регистратор
//	ТЧ 			- Строка
//	ПД 			- РегистрыНакопления.бестОбъемНачисленийЭлектроэнергии.ПД.ПериодНачисления
//
Процедура ЗаполнитьДанныеКорректировки(Договор,Регистратор,ТЧ,ПД) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестОбъемНачисленийЭлектроэнергии.Организация КАК Организация,
		|	бестОбъемНачисленийЭлектроэнергии.Район КАК Район,
		|	бестОбъемНачисленийЭлектроэнергии.ПериодНачисления КАК ПериодНачисления,
		|	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета КАК ОбъектРасчета,
		|	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета КАК ТочкаУчета,
		|	бестОбъемНачисленийЭлектроэнергии.Услуга КАК Услуга,
		|	бестОбъемНачисленийЭлектроэнергии.Договор КАК Договор,
		|	бестОбъемНачисленийЭлектроэнергии.ОбъемУслуги КАК ОбъемУслуги,
		|	бестОбъемНачисленийЭлектроэнергии.СуммаСредневзвешенная КАК СуммаСредневзвешенная,
		|	бестОбъемНачисленийЭлектроэнергии.СуммаЗаСбытовуюНадбавку КАК СуммаЗаСбытовуюНадбавку, 
		|	бестОбъемНачисленийЭлектроэнергии.СуммаЗаСбытовуюНадбавкуПокупатель КАК СуммаЗаСбытовуюНадбавкуПокупатель,
		|	бестОбъемНачисленийЭлектроэнергии.СуммаЗаУслугиПоПередачи КАК СуммаЗаУслугиПоПередачи,
		|	бестОбъемНачисленийЭлектроэнергии.СуммаЗаИныеУслуги КАК СуммаЗаИныеУслуги,
		|	бестОбъемНачисленийЭлектроэнергии.СуммаСредневзвешеннаяНДС КАК СуммаСредневзвешеннаяНДС,
		|	бестОбъемНачисленийЭлектроэнергии.СуммаЗаСбытовуюНадбавкуНДС КАК СуммаЗаСбытовуюНадбавкуНДС,
		|	бестОбъемНачисленийЭлектроэнергии.СуммаЗаСбытовуюНадбавкуНДСПокупатель КАК СуммаЗаСбытовуюНадбавкуНДСПокупатель,
		|	бестОбъемНачисленийЭлектроэнергии.СуммаЗаУслугиПоПередачиНДС КАК СуммаЗаУслугиПоПередачиНДС,
		|	бестОбъемНачисленийЭлектроэнергии.СуммаЗаИныеУслугиНДС КАК СуммаЗаИныеУслугиНДС,
		|	бестОбъемНачисленийЭлектроэнергии.ТарифНаИныеУслуги КАК ТарифНаИныеУслуги,
		|	бестОбъемНачисленийЭлектроэнергии.ТарифЗаСбытовуюНадбавку КАК ТарифЗаСбытовуюНадбавку,
		|	бестОбъемНачисленийЭлектроэнергии.ТарифЗаСбытовуюНадбавкуПокупатель КАК ТарифЗаСбытовуюНадбавкуПокупатель,
		|	бестОбъемНачисленийЭлектроэнергии.ТарифЗаУслугиПоПередачи КАК ТарифЗаУслугиПоПередачи,
		|	бестОбъемНачисленийЭлектроэнергии.СтавкаНДС КАК СтавкаНДС,
		|	бестОбъемНачисленийЭлектроэнергии.ПериодРасчета КАК ПериодРасчета,
		|	бестОбъемНачисленийЭлектроэнергии.Сумма КАК Сумма,
		|	бестОбъемНачисленийЭлектроэнергии.СуммаНДС КАК СуммаНДС,
		|	бестОбъемНачисленийЭлектроэнергии.НДСВнутри КАК НДСВнутри,
		|	бестОбъемНачисленийЭлектроэнергии.Тариф КАК Тариф,
		|	бестОбъемНачисленийЭлектроэнергии.Тариф - бестОбъемНачисленийЭлектроэнергии.ТарифНаИныеУслуги - бестОбъемНачисленийЭлектроэнергии.ТарифЗаСбытовуюНадбавку - бестОбъемНачисленийЭлектроэнергии.ТарифЗаСбытовуюНадбавкуПокупатель - бестОбъемНачисленийЭлектроэнергии.ТарифЗаУслугиПоПередачи КАК ТарифНаСредневзвешанную
		|ИЗ
		|	РегистрНакопления.бестОбъемНачисленийЭлектроэнергии КАК бестОбъемНачисленийЭлектроэнергии
		|ГДЕ
		|	бестОбъемНачисленийЭлектроэнергии.Регистратор = &Регистратор
		|	И бестОбъемНачисленийЭлектроэнергии.Договор = &Договор
		|	И бестОбъемНачисленийЭлектроэнергии.ПериодНачисления = &ПериодНачисления
		|	И бестОбъемНачисленийЭлектроэнергии.ОбъемУслуги > 0";
	
	Запрос.УстановитьПараметр("Договор", 		 Договор);
	Запрос.УстановитьПараметр("Регистратор", 	 Регистратор);
	Запрос.УстановитьПараметр("ПериодНачисления",ПД.ПериодНачисления);

		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляЗаполненияТЧ(ОбъектРасчета, ТочкаУчета, ПериодРасчета, Период,ПриборУчета) Экспорт

	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ТарифнаяКатегория КАК ТарифнаяКатегория
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами КАК бестЗаключениеДоговоровСЮридическимиЛицами
		|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицами.Ссылка
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ТочкаУчета = &ТочкаУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория
		|ИЗ
		|	РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
		|			&ПериодРасчета,
		|			ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности КАК ВидДифференцированности
		|ИЗ
		|	РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(&Период, ) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
		|ГДЕ
		|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ТочкаУчета = &ТочкаУчета
		|	И бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета = &ПриборУчета");
	
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);

	Результаты = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	МассивРезультатов = Новый Массив;
	МассивРезультатов.Добавить(Новый Структура("Имя,Результат", "ТарифнаяКатегория", Результаты[0]));
	МассивРезультатов.Добавить(Новый Структура("Имя,Результат", "ЦеноваяКатегория", Результаты[1]));
	МассивРезультатов.Добавить(Новый Структура("Имя,Результат", "ВидДифференцированности", Результаты[2]));
	
	Возврат ЗаполнитьСтруктуруДанныхДляВывода(МассивРезультатов);
	
КонецФункции

Функция ПолучитьУровеньНапряженияРасчетныйМощностьТочкуПоставки(ОбъектРасчета, ТочкаУчета, ПериодРасчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
		|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
		|	энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность КАК МаксимальнаяМощность
		|ИЗ
		|	РегистрСведений.бестТочкиПоставкиТочекУчетаЮЛ.СрезПоследних(&ПериодРасчета, ОбъектРасчета = &ОбъектРасчета И ТочкаУчета = &ТочкаУчета) КАК бестТочкиПоставкиТочекУчетаЮЛСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(КонецПериода(&ПериодРасчета, ДЕНЬ), ) КАК энргПараметрыТочекПоставкиСрезПоследних
		|		ПО (бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаПоставки = энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки)";
	
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УровеньНапряженияРасчетный = ВыборкаДетальныеЗаписи.УровеньНапряженияРасчетный;
		МаксимальнаяМощность = ВыборкаДетальныеЗаписи.МаксимальнаяМощность;
		ТочкаПоставки = ВыборкаДетальныеЗаписи.ТочкаПоставки;
	КонецЦикла;
	
	УровеньнапрИМощность = Новый Структура;
	УровеньнапрИМощность.Вставить("УровеньНапряженияРасчетный", УровеньНапряженияРасчетный);
	УровеньнапрИМощность.Вставить("МаксимальнаяМощность", МаксимальнаяМощность);
	УровеньнапрИМощность.Вставить("ТочкаПоставки", ТочкаПоставки);
	Возврат УровеньнапрИМощность;

КонецФункции

Функция ПолучитьТарифыНеНаселение(МаксМощность, Организация, ПериодРасчета, Поставщик, УровеньНапряженияРасчетный, Услуга, ЦеноваяКатегория, Район) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	бестЗначенияСбытовойНадбавкиСрезПоследних.Значение КАК ТарифЗаСбытовуюНадбавку
	                      |ИЗ
	                      |	РегистрСведений.бестЗначенияСбытовойНадбавки.СрезПоследних(
	                      |			&ПериодРасчета,
	                      |			Поставщик = &Поставщик
	                      |				И Услуга = &Услуга) КАК бестЗначенияСбытовойНадбавкиСрезПоследних
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестДиапазоныМощности КАК бестДиапазоныМощности
	                      |		ПО бестЗначенияСбытовойНадбавкиСрезПоследних.ДиапазонМощности = бестДиапазоныМощности.Ссылка
	                      |ГДЕ
	                      |	бестДиапазоныМощности.От <= &МаксМощность
	                      |	И бестДиапазоныМощности.До >= &МаксМощность
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	бестТарифыНаПередачуЭлектроэнергииСрезПоследних.Значение КАК ТарифЗаУслугиПоПередачи
	                      |ИЗ
	                      |	РегистрСведений.бестТарифыНаПередачуЭлектроэнергии.СрезПоследних(
	                      |			&ПериодРасчета,
	                      |			Услуга = &Услуга
	                      |				И КатегорияНапряжения = &УровеньНапряженияРасчетный
	                      |				И ЦеноваяКатегория = &ЦеноваяКатегория
	                      |				И Район = &Район) КАК бестТарифыНаПередачуЭлектроэнергииСрезПоследних
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	бестЗначенияПлатыЗаИныеУслугиСрезПоследних.Значение КАК ТарифНаИныеУслуги
	                      |ИЗ
	                      |	РегистрСведений.бестЗначенияПлатыЗаИныеУслуги.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК бестЗначенияПлатыЗаИныеУслугиСрезПоследних");
		
		
	Запрос.УстановитьПараметр("МаксМощность", МаксМощность);
	Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("УровеньНапряженияРасчетный", УровеньНапряженияРасчетный);
	Запрос.УстановитьПараметр("ЦеноваяКатегория", ЦеноваяКатегория);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	Результаты = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	МассивРезультатов = Новый Массив;
	МассивРезультатов.Добавить(Новый Структура("Имя,Результат", "ТарифЗаСбытовуюНадбавку", Результаты[0]));
	МассивРезультатов.Добавить(Новый Структура("Имя,Результат", "ТарифЗаУслугиПоПередачи", Результаты[1]));
	МассивРезультатов.Добавить(Новый Структура("Имя,Результат", "ТарифНаИныеУслуги", Результаты[2]));
	
	Возврат ЗаполнитьСтруктуруДанныхДляВывода(МассивРезультатов);
	
КонецФункции

Функция ПолучитьТарифСредневзвешенный(ПериодНачисления, Поставщик, ТарифнаяЗона, Услуга, ЦеноваяКатегория, Район) Экспорт

	Если ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.Население Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("ТарифнаяЗона", ТарифнаяЗона);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("ЦеноваяКатегория", ЦеноваяКатегория); 
	Запрос.УстановитьПараметр("Район", Район);
	
	Если ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.ПерваяЦК
		ИЛИ ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.ВтораяЦК Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестЗначенияНерегулируемойЦены.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.бестЗначенияНерегулируемойЦены КАК бестЗначенияНерегулируемойЦены
			|ГДЕ
			|	бестЗначенияНерегулируемойЦены.ПериодНачисления = &ПериодНачисления
			|	И бестЗначенияНерегулируемойЦены.Поставщик = &Поставщик
			|	И бестЗначенияНерегулируемойЦены.Услуга = &Услуга
			|	И бестЗначенияНерегулируемойЦены.ЦеноваяКатегория = &ЦеноваяКатегория
			|	И бестЗначенияНерегулируемойЦены.ТарифнаяЗона = &ТарифнаяЗона
			|	И бестЗначенияНерегулируемойЦены.Район = &Район";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестПочасовыеЗначенияНерегулируемойЦены.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.бестПочасовыеЗначенияНерегулируемойЦены КАК бестПочасовыеЗначенияНерегулируемойЦены
			|ГДЕ
			|	бестПочасовыеЗначенияНерегулируемойЦены.ПериодНачисления = &ПериодНачисления
			|	И бестПочасовыеЗначенияНерегулируемойЦены.Поставщик = &Поставщик
			|	И бестПочасовыеЗначенияНерегулируемойЦены.Услуга = &Услуга
			|	И бестПочасовыеЗначенияНерегулируемойЦены.ЦеноваяКатегория = &ЦеноваяКатегория
			|	И бестПочасовыеЗначенияНерегулируемойЦены.Район = &Район";
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Значение = ВыборкаДетальныеЗаписи.Значение/1000;
	КонецЦикла;
	
	Возврат Значение;
	
КонецФункции

Функция ЗаполнитьСтруктуруДанныхДляВывода(МассивРезультатов)
	
	Данные = Новый Структура;
	Для Каждого Элемент Из МассивРезультатов Цикл
		Выборка = Элемент.Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗначениеПоля = Выборка[Элемент.Имя]; // ← вот здесь имя поля используется динамически
			Данные.Вставить(Элемент.Имя, ЗначениеПоля);
		Иначе
			Данные.Вставить(Элемент.Имя, Неопределено)
		КонецЕсли;
	КонецЦикла;
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#КонецЕсли
